In [3]:
import pandas as pd
import numpy as np
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
from sqlalchemy.types import *

In [4]:
connection = "mysql+pymysql://root:root@localhost/movies"

In [5]:
engine = create_engine(connection)

In [23]:
if database_exists(connection) == False:
    create_database(connection)
else :
    print('it exists')

it exists

In [10]:
basics = pd.read_csv('Loading_Cleaning/Data/title_basics.csv.gz', low_memory = False)
basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 79520 entries, 0 to 79519
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          79520 non-null  object
 1   titleType       79520 non-null  object
 2   primaryTitle    79520 non-null  object
 3   originalTitle   79520 non-null  object
 4   isAdult         79520 non-null  int64
 5   startYear       79520 non-null  int64
 6   endYear         0 non-null      float64
 7   runtimeMinutes  79520 non-null  int64
 8   genres          79520 non-null  object
dtypes: float64(1), int64(3), object(5)
memory usage: 5.5+ MB

In [11]:
basics = basics.drop(columns=['originalTitle','isAdult','titleType', 'endYear'])

In [12]:
basics['split_genres'] = basics['genres'].str.split(',')
basics

,tconst,primaryTitle,startYear,runtimeMinutes,genres,split_genres
0,tt0035423,Kate & Leopold,2001,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70,Drama,[Drama]
2,tt0069049,The Other Side of the Wind,2018,122,Drama,[Drama]
3,tt0088751,The Naked Monster,2005,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
4,tt0094859,Chief Zabu,2016,74,Comedy,[Comedy]
...,...,...,...,...,...,...
79515,tt9914942,Life Without Sara Amat,2019,74,Drama,[Drama]
79516,tt9915872,The Last White Witch,2019,97,"Comedy,Drama,Fantasy","[Comedy, Drama, Fantasy]"
79517,tt9916170,The Rehearsal,2019,51,Drama,[Drama]
79518,tt9916190,Safeguard,2020,95,"Action,Adventure,Thriller","[Action, Adventure, Thriller]"
79519,tt9916362,Coven,2020,92,"Drama,History","[Drama, History]"

In [13]:
g_explode = basics.explode('split_genres')
g_explode.head()

,tconst,primaryTitle,startYear,runtimeMinutes,genres,split_genres
0,tt0035423,Kate & Leopold,2001,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,Kate & Leopold,2001,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,Kate & Leopold,2001,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70,Drama,Drama
2,tt0069049,The Other Side of the Wind,2018,122,Drama,Drama

In [15]:
unique_genres = sorted(g_explode['split_genres'].unique())

In [16]:
title_genres = g_explode[['tconst', 'split_genres']]
title_genres.head()

      tconst split_genres
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

In [17]:
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [18]:
title_genres['genre_id'] = title_genres['split_genres'].map(genre_map)
title_genres = title_genres.drop(columns='split_genres')
title_genres.head()

C:\Users\cheye\AppData\Local\Temp\ipykernel_16600\4180632589.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  title_genres['genre_id'] = title_genres['split_genres'].map(genre_map)

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18
1  tt0062336         7
2  tt0069049         7

In [19]:
genres = pd.DataFrame({'genre_name': genre_map.keys(),'genre_id':genre_map.values()})
genres.head()

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [21]:
basics = basics.drop(columns=['split_genres', 'genres'])
basics.head()

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70
2,tt0069049,The Other Side of the Wind,2018,122
3,tt0088751,The Naked Monster,2005,100
4,tt0094859,Chief Zabu,2016,74

In [22]:
connection = "mysql+pymysql://root:root@localhost/movies"
engine = create_engine(connection)
engine

Engine(mysql+pymysql://root:***@localhost/movies)

In [27]:
key_len = basics['tconst'].fillna('').map(len).max()
title_len = basics['primaryTitle'].fillna('').map(len).max()

In [28]:
df_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Float(),
    'runtimeMinutes':Integer()}

In [29]:
basics.to_sql('title_basics',engine,dtype=df_schema,if_exists='replace',index=False)

79520

In [30]:
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [31]:
key_len = title_genres['tconst'].fillna('').map(len).max()

In [32]:
df_schema = {
    "tconst": String(key_len+1), 
    'genre_id': Integer()}

In [33]:
title_genres.to_sql('title_genres', engine, dtype=df_schema, 
                   if_exists = 'replace', index=False)

148793

In [34]:
name_len = genres['genre_name'].fillna('').map(len).max()

In [35]:
df_schema = {
    "genre_name": String(name_len+1), 
    'genre_id': Integer()}

In [36]:
genres.to_sql('genres', engine, dtype=df_schema,
                   if_exists = 'replace', index=False)

26

In [37]:
engine.execute('ALTER TABLE genres ADD PRIMARY KEY (`genre_id`);')

In [42]:
ratings = pd.read_csv(r'Loading_Cleaning/Data/title_ratings.csv.gz', low_memory = False)
ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1905
1  tt0000002            5.9       255
2  tt0000003            6.5      1700
3  tt0000004            5.7       167
4  tt0000005            6.2      2520

In [44]:
key_len = ratings['tconst'].fillna('').map(len).max()
df_schema = {
    "tconst": String(key_len+1), 
    'averageRating': Float(),
    'numVotes': Integer()}

ratings.to_sql('ratings', engine, dtype=df_schema,
                      if_exists = 'replace', index=False)
engine.execute('ALTER TABLE ratings ADD PRIMARY KEY (`tconst`);')

In [47]:
df = pd.read_csv('Loading_Cleaning/Data/tmdb_results_combined.csv.gz')
df.head()

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,tt0120467,0.0,/knok3mNReKqPTplnnqz7E4dd7mD.jpg,NaN,120000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 27, 'name...",NaN,19085.0,en,Vulgar,...,14904.0,87.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Everyone loves a clown... some more than others.,Vulgar,0.0,5.400,42.0,R
1,tt0120913,0.0,/pniACHS8KDVCldB3BlwL78RIZ7V.jpg,NaN,75000000.0,"[{'id': 16, 'name': 'Animation'}, {'id': 28, '...",NaN,7450.0,en,Titan A.E.,...,36754634.0,94.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,"When Earth Ends, The Adventure Begins.",Titan A.E.,0.0,6.590,873.0,PG
2,tt0122459,0.0,/oNOJoW2XoH3shkQxHtOyacJRBCQ.jpg,NaN,24000000.0,"[{'id': 10749, 'name': 'Romance'}, {'id': 35, ...",NaN,2621.0,en,Return to Me,...,36609995.0,115.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,A comedy straight from the heart,Return to Me,0.0,6.701,324.0,PG
3,tt0127349,0.0,/wW2binZ7EVPGy5gEsIoMKICckcQ.jpg,NaN,8500000.0,"[{'id': 9648, 'name': 'Mystery'}, {'id': 18, '...",NaN,37722.0,en,Waking the Dead,...,327418.0,105.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Sometimes love has a life of it's own.,Waking the Dead,0.0,6.300,69.0,R
4,tt0134084,0.0,/yZK4T7ZDQcQr5omvSnJnR9IzBVa.jpg,"{'id': 2602, 'name': 'Scream Collection', 'pos...",40000000.0,"[{'id': 27, 'name': 'Horror'}, {'id': 9648, 'n...",NaN,4234.0,en,Scream 3,...,161834276.0,116.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Someone has taken their love of trilogies one ...,Scream 3,0.0,5.945,2616.0,R

In [49]:
df = df[['imdb_id','budget','revenue','certification']]
df.head()

     imdb_id      budget      revenue certification
0  tt0120467    120000.0      14904.0             R
1  tt0120913  75000000.0   36754634.0            PG
2  tt0122459  24000000.0   36609995.0            PG
3  tt0127349   8500000.0     327418.0             R
4  tt0134084  40000000.0  161834276.0             R

In [57]:
tmdb_len = df['imdb_id'].fillna('').map(len).max()
cert_len = df['certification'].fillna('').map(len).max()
df_schema = {
    'imdb_id':String(tmdb_len+1),
    'budget':Float(),
    'revenue':Float(),
    'certification':Text(cert_len+1)}
#save to swl
df.to_sql('tmdb_data', engine, dtype=df_schema, if_exists='replace', index=False)
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);')

In [58]:
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_movies
0           genres
1          ratings
2     title_basics
3     title_genres
4        tmdb_data

In [59]:
q = """
SELECT * 
FROM genres LIMIT 5
;"""
pd.read_sql(q, engine)

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [60]:
q = """
SELECT * 
FROM ratings LIMIT 5
;"""
pd.read_sql(q, engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1905
1  tt0000002            5.9       255
2  tt0000003            6.5      1700
3  tt0000004            5.7       167
4  tt0000005            6.2      2520

In [61]:
q = """
SELECT * 
FROM title_basics LIMIT 5
;"""
pd.read_sql(q, engine)

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70
2,tt0069049,The Other Side of the Wind,2018.0,122
3,tt0088751,The Naked Monster,2005.0,100
4,tt0094859,Chief Zabu,2016.0,74

In [62]:

q = """
SELECT * 
FROM title_genres LIMIT 5
;"""
pd.read_sql(q, engine)

      tconst  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0062336         7
4  tt0069049         7

In [63]:
q = """
SELECT * 
FROM tmdb_data LIMIT 5
;"""
pd.read_sql(q, engine)

     imdb_id      budget     revenue certification
0  tt0120467    120000.0     14904.0             R
1  tt0120824  38000000.0  24690400.0             R
2  tt0120913  75000000.0  36754600.0            PG
3  tt0122459  24000000.0  36610000.0            PG
4  tt0127349   8500000.0    327418.0             R